Autodesk.Revit.DB.ProjectLocation.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.String)
Create an instance of ProjectLocation in the document.
Remarks:
The created instace of ProjectLocation would have the specified name and an identity Transform.
document:
The document where the new instance of ProjectLocation would be created in.
siteLocationId:
The ElementId of the SiteLocation to which the new ProjectLocation would be created.
name:
The name of the instance of ProjectLocation to be created.
Returns:
The newly created instance of ProjectLocation.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
The element siteLocationId does not exist in the document
-or-
name cannot include prohibited characters.
-or-
There is already a ProjectLocation with this name in the given SiteLocation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2018